apache/nuttx/arch/arm/include/kinetis/chip.h
#  undef  KINETIS_MPU                          /* No memory protection unit */
#  undef  KINETIS_EXTBUS                       /* No external bus interface */
#  define KINETIS_NDMACH          16           /* Up to 16 DMA channels */
#  undef  KINETIS_NENET                        /* No Ethernet controller */
#  define KINETIS_NUSBHOST        1            /* One USB host controller */
#  define KINETIS_NUSBOTG         1            /* With USB OTG controller */
#  define KINETIS_NUSBDEV         1            /* One USB device controller */
#  undef  KINETIS_NSDHC                        /* No SD host controller */
#  undef  KINETIS_NTOUCHIF                     /* Xtrinsic touch sensing interface */
#  define KINETIS_NI2C            2            /* Two I2C modules */
#  undef  KINETIS_NISO7816                     /* No UART with ISO-786 */
#  define KINETIS_NUART           3            /* Three UARTs */
#  define KINETIS_NSPI            1            /* One SPI module */
#  define KINETIS_NCAN            1            /* Two CAN controller */
#  define KINETIS_NI2S            1            /* One I2S module */
#  undef  KINETIS_NSLCD                        /* No segment LCD interface */
#  define KINETIS_NADC16          2            /* Two 16-bit ADC */
#  undef  KINETIS_NADC12                       /* No 12-channel ADC */
#  undef  KINETIS_NADC13                       /* No 13-channel ADC */
#  undef  KINETIS_NADC15                       /* No 15-channel ADC */
#  undef  KINETIS_NADC18                       /* No 18-channel ADC */
#  define KINETIS_NPGA            2            /* Two Programmable Gain Amplifiers */
#  define KINETIS_NCMP            3            /* Three analog comparators */
#  define KINETIS_NDAC6           3            /* Three 6-bit DAC */
#  define KINETIS_NDAC12          1            /* One 12-bit DAC */
#  define KINETIS_NVREF           1            /* Voltage reference */
#  define KINETIS_NTIMERS12       2            /* Two 12 channel timers */
#  undef  KINETIS_NTIMERS20                    /* No 20 channel timers */
#  undef  KINETIS_NRNG                         /* No random number generator */
#  define KINETIS_NRTC            1            /* Real time clock */
#  undef  KINETIS_NMMCAU                       /* No hardware encryption */
#  undef  KINETIS_NTAMPER                      /* No tamper detect */
#  undef  KINETIS_NCRC                         /* No CRC */

/* MK28FN2M0---15-
 *
 *  --------------- ------- --- ------- ------ ------- ------ -----
 *  PART NUMBER     CPU     PIN PACKAGE PROGRAM EEPROM SRAM  GPIO
 *                  FREQ    CNT         FLASH
 *  --------------- ------- --- ------- ------ ------- ------ -----
 *  MK28FN2M0VMI15  150 MHz 169  MAPBGA  2 MB   None    1 MB  120
 *  MK28FN2M0CAU15R 150 MHz 210  WLCSP   2 MB   None    1 MB  120
 *  --------------- ------- --- ------- ------ ------- ------ -----
 */

#elif defined(CONFIG_ARCH_CHIP_MK28FN2M0VMI15) || \
      defined(CONFIG_ARCH_CHIP_MK28FN2M0CAU15R)

#  undef  KINETIS_K20                          /* Not Kinetis K20 family */
#  define KINETIS_K28             1            /* Kinetis K28 family */
#  undef  KINETIS_K40                          /* Not Kinetis K40 family */
#  undef  KINETIS_K60                          /* Not Kinetis K60 family */
#  undef  KINETIS_K64                          /* Not Kinetis K64 family */
#  undef  KINETIS_K66                          /* Not Kinetis K66 family */

#define KINETIS_FLASH_SIZE       (2*1024*1024) /* 2 Mb */
#  define KINETIS_FLEXMEM_SIZE   (0)           /* No FlexMemory */
#define KINETIS_SRAM_SIZE        (1*1024*1014) /* 1 Mb */

#  define KINETIS_MPU             1            /* Memory protection unit */
#  define KINETIS_MPU_NEGIONS     12           /* 12 MPU descriptors */
#  define KINETIS_EXTBUS          1            /* External bus interface (REVISIT) */
#  define KINETIS_NDMACH          32           /* 32 channel asynchronous DMA */
#  undef  KINETIS_NENET                        /* No Ethernet controller */
#  define KINETIS_NUSBHOST        2            /* Two USB host controllers (FS/HS) */
#  define KINETIS_NUSBOTG         2            /* Two USB OTG controllers (FS/HS) */
#  define KINETIS_NUSBDEV         2            /* Two USB device controllers (FS/HS) */
#  define KINETIS_NSDHC           1            /* One SD host controller */
#  undef  KINETIS_NTOUCHIF                     /* Xtrinsic touch sensing interface */
#  define KINETIS_NI2C            4            /* Four I2C modules */
#  undef  KINETIS_NISO7816                     /* No UART with ISO-786 */
#  define KINETIS_NUART           0            /* No UARTs */
#  define KINETIS_NLPUART         5            /* Five LPUART modules */
#  define KINETIS_NSPI            4            /* Four SPI modules */
#  undef  KINETIS_NCAN                         /* No CAN controller */
#  define KINETIS_NI2S            2            /* Two I2S modules */
#  undef  KINETIS_NSLCD                        /* No segment LCD interface */
#  define KINETIS_NADC16          32           /* 32 16-bit ADC (Some reserved) */
#  undef  KINETIS_NADC12                       /* No 12-channel ADC */
#  undef  KINETIS_NADC13                       /* No 13-channel ADC */
#  undef  KINETIS_NADC15                       /* No 15-channel ADC */
#  undef  KINETIS_NADC18                       /* No 18-channel ADC */
#  undef  KINETIS_NPGA                         /* No Programmable Gain Amplifiers */
#  define KINETIS_NCMP            2            /* Two analog comparators */
#  define KINETIS_NDAC6           2            /* Two 6-bit DAC */
#  define KINETIS_NDAC12          1            /* One 12-bit DAC */
#  define KINETIS_NVREF           1            /* Voltage reference */
#  define KINETIS_NTIMERS8        2            /* Two 8 channel FTM timers */
#  define KINETIS_NTIMERS2        2            /* Two 2 channel FTM timers */
#  define KINETIS_NTPMTIMERS2     2            /* Two 2 channel TPM timers */
#  define KINETIS_NRNG            1            /* Random number generator */
#  define KINETIS_NRTC            1            /* Real time clock */
#  define KINETIS_NMMCAU          1            /* Hardware encryption */
#  undef  KINETIS_NTAMPER                      /* No tamper detect */
#  define KINETIS_NCRC            1            /* CRC */

#elif defined(CONFIG_ARCH_CHIP_MK40X64VFX50) || defined(CONFIG_ARCH_CHIP_MK40X64VLH50) || \
    defined(CONFIG_ARCH_CHIP_MK40X64VLK50) || defined(CONFIG_ARCH_CHIP_MK40X64VMB50)

#  undef  KINETIS_K20                          /* Not Kinetis K20 family */
#  undef  KINETIS_K28                          /* Not Kinetis K28 family */
#  define KINETIS_K40             1            /* Kinetis K40 family */
#  undef  KINETIS_K60                          /* Not Kinetis K60 family */
#  undef  KINETIS_K64                          /* Not Kinetis K64 family */
#  undef  KINETIS_K66                          /* Not Kinetis K66 family */

#  define KINETIS_FLASH_SIZE      (64*1024)    /* 64Kb */
#  define KINETIS_FLEXMEM_SIZE    (32*1024)    /* 32Kb */
#  define KINETIS_SRAM_SIZE       (16*1024)    /* 16Kb */
#  undef  KINETIS_MPU                          /* No memory protection unit */
#  undef  KINETIS_EXTBUS                       /* No external bus interface */
#  define KINETIS_NDMACH          16           /* Up to 16 DMA channels */
#  undef  KINETIS_NENET                        /* No Ethernet controller */
#  define KINETIS_NUSBHOST        1            /* One USB host controller */
#  define KINETIS_NUSBOTG         1            /* With USB OTG controller */
#  define KINETIS_NUSBDEV         1            /* One USB device controller */
#  undef  KINETIS_NSDHC                        /* No SD host controller */
#  undef  KINETIS_NTOUCHIF                     /* Xtrinsic touch sensing interface */
#  define KINETIS_NI2C            2            /* Two I2C modules */
#  undef  KINETIS_NISO7816                     /* No UART with ISO-786 */
#  define KINETIS_NUART           6            /* Six UARTs */
#  define KINETIS_NSPI            3            /* Three SPI modules */
#  if defined(CONFIG_ARCH_CHIP_MK40X64VLK50) || defined(CONFIG_ARCH_CHIP_MK40X64VMB50)
#    define KINETIS_NCAN          2            /* Two CAN controllers */
#  else
#    undef KINETIS_NCAN                        /* No CAN in 64-pin chips */
#  endif
#  define KINETIS_NI2S            1            /* One I2S module */
#  define KINETIS_NSLCD           1            /* One segment LCD interface (up to 25x8/29x4) */
#  define KINETIS_NADC16          4            /* Four 16-bit ADC */
#  undef  KINETIS_NADC12                       /* No 12-channel ADC */
#  undef  KINETIS_NADC13                       /* No 13-channel ADC */
#  undef  KINETIS_NADC15                       /* No 15-channel ADC */
#  undef  KINETIS_NADC18                       /* No 18-channel ADC */
#  define KINETIS_NPGA            2            /* Two Programmable Gain Amplifiers */
#  define KINETIS_NCMP            3            /* Three analog comparators */
#  define KINETIS_NDAC6           3            /* Three 6-bit DAC */
#  define KINETIS_NDAC12          2            /* Two 12-bit DAC */
#  define KINETIS_NVREF           1            /* Voltage reference */
#  define KINETIS_NTIMERS12       3            /* Three 12 channel timers */
#  undef  KINETIS_NTIMERS20                    /* No 20 channel timers */
#  undef  KINETIS_NRNG                         /* No random number generator */
#  define KINETIS_NRTC            1            /* Real time clock */
#  undef  KINETIS_NMMCAU                       /* No hardware encryption */
#  undef  KINETIS_NTAMPER                      /* No tamper detect */
#  define KINETIS_NCRC            1            /* CRC */

#elif defined(CONFIG_ARCH_CHIP_MK40X128VFX50) || defined(CONFIG_ARCH_CHIP_MK40X128VLH50) || \
    defined(CONFIG_ARCH_CHIP_MK40X128VLK50) || defined(CONFIG_ARCH_CHIP_MK40X128VMB50) || \
    defined(CONFIG_ARCH_CHIP_MK40X128VLL50) || defined(CONFIG_ARCH_CHIP_MK40X128VML50) || \
    defined(CONFIG_ARCH_CHIP_MK40X128VFX72) || defined(CONFIG_ARCH_CHIP_MK40X128VLH72) || \
    defined(CONFIG_ARCH_CHIP_MK40X128VLK72) || defined(CONFIG_ARCH_CHIP_MK40X128VMB72) || \
    defined(CONFIG_ARCH_CHIP_MK40X128VLL72) || defined(CONFIG_ARCH_CHIP_MK40X128VML72)

#  undef  KINETIS_K20                          /* Not Kinetis K20 family */
#  undef  KINETIS_K28                          /* Not Kinetis K28 family */
#  define KINETIS_K40             1            /* Kinetis K40 family */
#  undef  KINETIS_K60                          /* Not Kinetis K60 family */
#  undef  KINETIS_K64                          /* Not Kinetis K64 family */
#  undef  KINETIS_K66                          /* Not Kinetis K66 family */

#  define KINETIS_FLASH_SIZE      (128*1024)   /* 128Kb */
#  define KINETIS_FLEXMEM_SIZE    (32*1024)    /* 32Kb */
#  define KINETIS_SRAM_SIZE       (32*1024)    /* 32Kb */
#  undef  KINETIS_MPU                          /* No memory protection unit */
#  undef  KINETIS_EXTBUS                       /* No external bus interface */
#  define KINETIS_NDMACH          16           /* Up to 16 DMA channels */
#  undef  KINETIS_NENET                        /* No Ethernet controller */
#  define KINETIS_NUSBHOST        1            /* One USB host controller */
#  define KINETIS_NUSBOTG         1            /* With USB OTG controller */
#  define KINETIS_NUSBDEV         1            /* One USB device controller */
#  undef  KINETIS_NSDHC                        /* No SD host controller */
#  undef  KINETIS_NTOUCHIF                     /* Xtrinsic touch sensing interface */
#  define KINETIS_NI2C            2            /* Two I2C modules */
#  undef  KINETIS_NISO7816                     /* No UART with ISO-786 */
#  define KINETIS_NUART           6            /* Six UARTs */
#  define KINETIS_NSPI            3            /* Three SPI modules */
#  define KINETIS_NCAN            2            /* Two CAN controllers */
#  define KINETIS_NI2S            1            /* One I2S module */
#  define KINETIS_NSLCD           1            /* One segment LCD interface (up to 36x8/40x4) */
#  define KINETIS_NADC16          4            /* Four 16-bit ADC */
#  undef  KINETIS_NADC12                       /* No 12-channel ADC */
#  undef  KINETIS_NADC13                       /* No 13-channel ADC */
#  undef  KINETIS_NADC15                       /* No 15-channel ADC */
#  undef  KINETIS_NADC18                       /* No 18-channel ADC */
#  define KINETIS_NPGA            2            /* Two Programmable Gain Amplifiers */
#  define KINETIS_NCMP            3            /* Three analog comparators */
#  define KINETIS_NDAC6           3            /* Three 6-bit DAC */
#  define KINETIS_NDAC12          2            /* Two 12-bit DAC */
#  define KINETIS_NVREF           1            /* Voltage reference */
#  define KINETIS_NTIMERS12       3            /* Three 12 channel timers */
#  undef  KINETIS_NTIMERS20                    /* No 20 channel timers */
#  define KINETIS_NRTC            1            /* Real time clock */
#  undef  KINETIS_NRNG                         /* No random number generator */
#  undef  KINETIS_NMMCAU                       /* No hardware encryption */
#  undef  KINETIS_NTAMPER                      /* No tamper detect */
#  define KINETIS_NCRC            1            /* CRC */

#elif defined(CONFIG_ARCH_CHIP_MK40X256VLK72) || defined(CONFIG_ARCH_CHIP_MK40X256VMB72) || \
    defined(CONFIG_ARCH_CHIP_MK40X256VLL72) || defined(CONFIG_ARCH_CHIP_MK40X256VML72)

#  undef  KINETIS_K20                          /* Not Kinetis K20 family */
#  undef  KINETIS_K28                          /* Not Kinetis K28 family */
#  define KINETIS_K40             1            /* Kinetis K40 family */
#  undef  KINETIS_K60                          /* Not Kinetis K60 family */
#  undef  KINETIS_K64                          /* Not Kinetis K64 family */
#  undef  KINETIS_K66                          /* Not Kinetis K66 family */

#  define KINETIS_FLASH_SIZE      (256*1024)   /* 256Kb */
#  define KINETIS_FLEXMEM_SIZE    (32*1024)    /* 32Kb */
#  define KINETIS_SRAM_SIZE       (32*1024)    /* 64Kb */
#  undef  KINETIS_MPU                          /* No memory protection unit */
#  undef  KINETIS_EXTBUS                       /* No external bus interface */
#  define KINETIS_NDMACH          16           /* Up to 16 DMA channels */
#  undef  KINETIS_NENET                        /* No Ethernet controller */
#  define KINETIS_NUSBHOST        1            /* One USB host controller */
#  define KINETIS_NUSBOTG         1            /* With USB OTG controller */
#  define KINETIS_NUSBDEV         1            /* One USB device controller */
#  undef  KINETIS_NSDHC                        /* No SD host controller */
#  undef  KINETIS_NTOUCHIF                     /* Xtrinsic touch sensing interface */
#  define KINETIS_NI2C            2            /* Two I2C modules */
#  undef  KINETIS_NISO7816                     /* No UART with ISO-786 */
#  define KINETIS_NUART           6            /* Six UARTs */
#  define KINETIS_NSPI            3            /* Three SPI modules */
#  define KINETIS_NCAN            2            /* Two CAN controllers */
#  define KINETIS_NI2S            1            /* One I2S module */
#  define KINETIS_NSLCD           1            /* One segment LCD interface (up to 36x8/40x4) */
#  define KINETIS_NADC16          4            /* Four 16-bit ADC */
#  undef  KINETIS_NADC12                       /* No 12-channel ADC */
#  undef  KINETIS_NADC13                       /* No 13-channel ADC */
#  undef  KINETIS_NADC15                       /* No 15-channel ADC */
#  undef  KINETIS_NADC18                       /* No 18-channel ADC */
#  define KINETIS_NPGA            2            /* Two Programmable Gain Amplifiers */
#  define KINETIS_NCMP            3            /* Three analog comparators */
#  define KINETIS_NDAC6           3            /* Three 6-bit DAC */
#  define KINETIS_NDAC12          2            /* Two 12-bit DAC */
#  define KINETIS_NVREF           1            /* Voltage reference */
#  define KINETIS_NTIMERS12       3            /* Three 12 channel timers */
#  undef  KINETIS_NTIMERS20                    /* No 20 channel timers */
#  define KINETIS_NRTC            1            /* Real time clock */
#  undef  KINETIS_NRNG                         /* No random number generator */
#  undef  KINETIS_NMMCAU                       /* No hardware encryption */
#  undef  KINETIS_NTAMPER                      /* No tamper detect */
#  define KINETIS_NCRC            1            /* CRC */

#elif defined(CONFIG_ARCH_CHIP_MK40X128VLQ100) || defined(CONFIG_ARCH_CHIP_MK40X128VMD100)

#  undef  KINETIS_K20                          /* Not Kinetis K20 family */
#  undef  KINETIS_K28                          /* Not Kinetis K28 family */
#  define KINETIS_K40             1            /* Kinetis K40 family */
#  undef  KINETIS_K60                          /* Not Kinetis K60 family */
#  undef  KINETIS_K64                          /* Not Kinetis K64 family */
#  undef  KINETIS_K66                          /* Not Kinetis K66 family */

#  define KINETIS_FLASH_SIZE      (128*1024)   /* 128Kb */
#  define KINETIS_FLEXMEM_SIZE    (128*1024)   /* 128Kb */
#  define KINETIS_SRAM_SIZE       (32*1024)    /* 32Kb */
#  define KINETIS_MPU             1            /* Memory protection unit */
#  define KINETIS_MPU_NEGIONS     8            /* 8 MPU descriptors (REVISIT) */
#  define KINETIS_EXTBUS          1            /* External bus interface */
#  define KINETIS_NDMACH          16           /* Up to 16 DMA channels */
#  undef  KINETIS_NENET                        /* No Ethernet controller */
#  define KINETIS_NUSBHOST        1            /* One USB host controller */
#  define KINETIS_NUSBOTG         1            /* With USB OTG controller */
#  define KINETIS_NUSBDEV         1            /* One USB device controller */
#  define KINETIS_NSDHC           1            /* One SD host controller */
#  undef  KINETIS_NTOUCHIF                     /* Xtrinsic touch sensing interface */
#  define KINETIS_NI2C            2            /* Two I2C modules */
#  undef  KINETIS_NISO7816                     /* No UART with ISO-786 */
#  define KINETIS_NUART           6            /* Six UARTs */
#  define KINETIS_NSPI            3            /* Three SPI modules */
#  define KINETIS_NCAN            2            /* Two CAN controllers */
#  define KINETIS_NI2S            1            /* One I2S module */
#  define KINETIS_NSLCD           1            /* One segment LCD interface (up to 40x8/44x4)*/
#  define KINETIS_NADC16          4            /* Four 16-bit ADC */
#  undef  KINETIS_NADC12                       /* No 12-channel ADC */
#  undef  KINETIS_NADC13                       /* No 13-channel ADC */
#  undef  KINETIS_NADC15                       /* No 15-channel ADC */
#  undef  KINETIS_NADC18                       /* No 18-channel ADC */
#  define KINETIS_NPGA            2            /* Two Programmable Gain Amplifiers */
#  define KINETIS_NCMP            3            /* Three analog comparators */
#  define KINETIS_NDAC6           3            /* Three 6-bit DAC */
#  define KINETIS_NDAC12          2            /* Two 12-bit DAC */
#  define KINETIS_NVREF           1            /* Voltage reference */
#  define KINETIS_NTIMERS12       3            /* Three 12 channel timers */
#  undef  KINETIS_NTIMERS20                    /* No 20 channel timers */
#  define KINETIS_NRTC            1            /* Real time clock */
#  undef  KINETIS_NRNG                         /* No random number generator */
#  undef  KINETIS_NMMCAU                       /* No hardware encryption */
#  undef  KINETIS_NTAMPER                      /* No tamper detect */
#  define KINETIS_NCRC            1            /* CRC */

#elif defined(CONFIG_ARCH_CHIP_MK40X256VLQ100) || defined(CONFIG_ARCH_CHIP_MK40X256VMD100)

#  undef  KINETIS_K20                          /* Not Kinetis K20 family */
#  undef  KINETIS_K28                          /* Not Kinetis K28 family */
#  define KINETIS_K40             1            /* Kinetis K40 family */
#  undef  KINETIS_K60                          /* Not Kinetis K60 family */
#  undef  KINETIS_K64                          /* Not Kinetis K64 family */
#  undef  KINETIS_K66                          /* Not Kinetis K66 family */

#  define KINETIS_FLASH_SIZE      (256*1024)   /* 256Kb */
#  define KINETIS_FLEXMEM_SIZE    (256*1024)   /* 256Kb */
#  define KINETIS_SRAM_SIZE       (64*1024)    /* 32Kb */
#  define KINETIS_MPU             1            /* Memory protection unit */
#  define KINETIS_MPU_NEGIONS     8            /* 8 MPU descriptors (REVISIT) */
#  define KINETIS_EXTBUS          1            /* External bus interface */
#  define KINETIS_NDMACH          16           /* Up to 16 DMA channels */
#  undef  KINETIS_NENET                        /* No Ethernet controller */
#  define KINETIS_NUSBHOST        1            /* One USB host controller */
#  define KINETIS_NUSBOTG         1            /* With USB OTG controller */
#  define KINETIS_NUSBDEV         1            /* One USB device controller */
#  define KINETIS_NSDHC           1            /* One SD host controller */
#  undef  KINETIS_NTOUCHIF                     /* Xtrinsic touch sensing interface */
#  define KINETIS_NI2C            2            /* Two I2C modules */
#  undef  KINETIS_NISO7816                     /* No UART with ISO-786 */
#  define KINETIS_NUART           6            /* Six UARTs */
#  define KINETIS_NSPI            3            /* Three SPI modules */
#  define KINETIS_NCAN            2            /* Two CAN controllers */
#  define KINETIS_NI2S            1            /* One I2S module */
#  define KINETIS_NSLCD           1            /* One segment LCD interface (up to 40x8/44x4)*/
#  define KINETIS_NADC16          4            /* Four 16-bit ADC */
#  undef  KINETIS_NADC12                       /* No 12-channel ADC */
#  undef  KINETIS_NADC13                       /* No 13-channel ADC */
#  undef  KINETIS_NADC15                       /* No 15-channel ADC */
#  undef  KINETIS_NADC18                       /* No 18-channel ADC */
#  define KINETIS_NPGA            2            /* Two Programmable Gain Amplifiers */
#  define KINETIS_NCMP            3            /* Three analog comparators */
#  define KINETIS_NDAC6           3            /* Three 6-bit DAC */
#  define KINETIS_NDAC12          2            /* Two 12-bit DAC */
#  define KINETIS_NVREF           1            /* Voltage reference */
#  define KINETIS_NTIMERS12       3            /* Three 12 channel timers */
#  undef  KINETIS_NTIMERS20                    /* No 20 channel timers */
#  define KINETIS_NRTC            1            /* Real time clock */
#  undef  KINETIS_NRNG                         /* No random number generator */
#  undef  KINETIS_NMMCAU                       /* No hardware encryption */
#  undef  KINETIS_NTAMPER                      /* No tamper detect */
#  define KINETIS_NCRC            1            /* CRC */

#elif defined(CONFIG_ARCH_CHIP_MK40N512VLK100) || defined(CONFIG_ARCH_CHIP_MK40N512VMB100) || \
      defined(CONFIG_ARCH_CHIP_MK40N512VLL100) || defined(CONFIG_ARCH_CHIP_MK40N512VML100) || \
      defined(CONFIG_ARCH_CHIP_MK40N512VLQ100) || defined(CONFIG_ARCH_CHIP_MK40N512VMD100)

#  undef  KINETIS_K20                          /* Not Kinetis K20 family */
#  undef  KINETIS_K28                          /* Not Kinetis K28 family */
#  define KINETIS_K40             1            /* Kinetis K40 family */
#  undef  KINETIS_K60                          /* Not Kinetis K60 family */
#  undef  KINETIS_K64                          /* Not Kinetis K64 family */
#  undef  KINETIS_K66                          /* Not Kinetis K66 family */

