apache/nuttx/arch/arm/include/kinetis/chip.h
#elif defined(CONFIG_ARCH_CHIP_MK64FX512VMD12)

#  undef  KINETIS_K20                          /* Not Kinetis K20 family */
#  undef  KINETIS_K28                          /* Not Kinetis K28 family */
#  undef  KINETIS_K40                          /* Not Kinetis K40 family */
#  undef  KINETIS_K60                          /* Not Kinetis K60 family */
#  define KINETIS_K64             1            /* Kinetis K64 family */
#  undef  KINETIS_K66                          /* Not Kinetis K66 family */

#  define KINETIS_FLASH_SIZE      (1024*1024)  /* 1Mb */
#  undef  KINETIS_FLEXNVM_SIZE                 /* No FlexNVM */
#  define KINETIS_FLEXRAM_SIZE    (4*1024)     /* 4Kb */
#  define KINETIS_SRAM_SIZE       (256*1024)   /* 256Kb */
#  define KINETIS_MPU             1            /* Memory protection unit */
#  define KINETIS_MPU_NEGIONS     8            /* 8 MPU descriptors (REVISIT) */
#  define KINETIS_EXTBUS          1            /* External bus interface */
#  define KINETIS_NDMACH          16           /* Up to 16 DMA channels */
#  define KINETIS_NENET           1            /* One IEEE 1588 Ethernet controller */
#  define KINETIS_NUSBOTG         1            /* With USB OTG controller */
#  define KINETIS_NUSBDEV         1            /* One USB device controller */
#  define KINETIS_NSDHC           1            /* SD host controller */
#  define KINETIS_NI2C            3            /* Three I2C modules */
#  define KINETIS_NUART           6            /* Six UART modues */
#  define KINETIS_NSPI            3            /* Three SPI modules */
#  define KINETIS_NCAN            1            /* One CAN controllers */
#  define KINETIS_NI2S            1            /* One I2S modules */
#  define KINETIS_NSLCD           1            /* One segment LCD interface (up to 36x8/40x4) */
#  define KINETIS_NADC16          2            /* Four 16-bit ADC */
#  define KINETIS_NCMP            3            /* Three analog comparators */
#  define KINETIS_NDAC6           3            /* Three 6-bit DAC */
#  define KINETIS_NDAC12          2            /* Two 12-bit DAC */
#  define KINETIS_NVREF           1            /* Voltage reference */
#  define KINETIS_NTIMERS8        2            /* Two 8 channel timers */
#  define KINETIS_NTIMERS2        2            /* Two 2 channel timers */
#  define KINETIS_NRTC            1            /* Real time clock */
#  define KINETIS_NRNG            1            /* Random number generator */
#  define KINETIS_NMMCAU          1            /* Hardware encryption */
#  define KINETIS_NCRC            1            /* CRC */

#elif defined(CONFIG_ARCH_CHIP_MK64FN1M0VMD12)

#  undef  KINETIS_K20                          /* Not Kinetis K20 family */
#  undef  KINETIS_K28                          /* Not Kinetis K28 family */
#  undef  KINETIS_K40                          /* Not Kinetis K40 family */
#  undef  KINETIS_K60                          /* Not Kinetis K60 family */
#  define KINETIS_K64             1            /* Kinetis K64 family */
#  undef  KINETIS_K66                          /* Not Kinetis K66 family */

#  define KINETIS_FLASH_SIZE      (1024*1024)  /* 1Mb */
#  undef  KINETIS_FLEXNVM_SIZE                 /* No FlexNVM */
#  define KINETIS_FLEXRAM_SIZE    (4*1024)     /* 4Kb */
#  define KINETIS_SRAM_SIZE       (256*1024)   /* 256Kb */
#  define KINETIS_MPU             1            /* Memory protection unit */
#  define KINETIS_MPU_NEGIONS     8            /* 8 MPU descriptors (REVISIT) */
#  define KINETIS_EXTBUS          1            /* External bus interface */
#  define KINETIS_NDMACH          16           /* Up to 16 DMA channels */
#  define KINETIS_NENET           1            /* One IEEE 1588 Ethernet controller */
#  define KINETIS_NUSBOTG         1            /* With USB OTG controller */
#  define KINETIS_NUSBDEV         1            /* One USB device controller */
#  define KINETIS_NSDHC           1            /* SD host controller */
#  define KINETIS_NI2C            3            /* Three I2C modules */
#  define KINETIS_NUART           6            /* Six UART modues */
#  define KINETIS_NSPI            3            /* Three SPI modules */
#  define KINETIS_NCAN            1            /* One CAN controllers */
#  define KINETIS_NI2S            1            /* One I2S modules */
#  define KINETIS_NSLCD           1            /* One segment LCD interface (up to 36x8/40x4) */
#  define KINETIS_NADC16          2            /* Four 16-bit ADC */
#  define KINETIS_NCMP            3            /* Three analog comparators */
#  define KINETIS_NDAC6           3            /* Three 6-bit DAC */
#  define KINETIS_NDAC12          2            /* Two 12-bit DAC */
#  define KINETIS_NVREF           1            /* Voltage reference */
#  define KINETIS_NTIMERS8        2            /* Two 8 channel timers */
#  define KINETIS_NTIMERS2        2            /* Two 2 channel timers */
#  define KINETIS_NRTC            1            /* Real time clock */
#  define KINETIS_NRNG            1            /* Random number generator */
#  define KINETIS_NMMCAU          1            /* Hardware encryption */
#  define KINETIS_NCRC            1            /* CRC */

/* MK66F N/X 1M0/2M0 V MD/LQ 18
 *
 *  --------------- ------- --- ------- ------- ------ ------ ------ -----
 *  PART NUMBER     CPU     PIN PACKAGE  TOTAL  PROGRAM EEPROM SRAM  GPIO
 *                  FREQ    CNT          FLASH  FLASH
 *  --------------- ------- --- ------- ------- ------ ------ ------ -----
 *  MK66FN2M0VMD18  180 MHz 144 MAPBGA   2   MB    —    — KB  260 KB 100
 *  MK66FX1M0VMD18  180 MHz 144 MAPBGA  1.25 MB  1 MB   4 KB  256 KB 100
 *  MK66FN2M0VLQ18  180 MHz 144 LQFP     2   MB    —    — KB  260 KB 100
 *  MK66FX1M0VLQ18  180 MHz 144 LQFP    1.25 MB  1 MB   4 KB  256 KB 100
 */

#elif defined(CONFIG_ARCH_CHIP_MK66FN2M0VMD18) || \
      defined(CONFIG_ARCH_CHIP_MK66FX1M0VMD18) || \
      defined(CONFIG_ARCH_CHIP_MK66FN2M0VLQ18) || \
      defined(CONFIG_ARCH_CHIP_MK66FX1M0VLQ18)

#  undef  KINETIS_K20                          /* Not Kinetis K20 family */
#  undef  KINETIS_K28                          /* Not Kinetis K28 family */
#  undef  KINETIS_K40                          /* Not Kinetis K40 family */
#  undef  KINETIS_K60                          /* Not Kinetis K60 family */
#  undef  KINETIS_K64                          /* Not Kinetis K64 family */
#  define KINETIS_K66             1            /* Kinetis K66 family */

#  if defined(CONFIG_ARCH_CHIP_MK66FX1M0VMD18) || \
      defined(CONFIG_ARCH_CHIP_MK66FX1M0VLQ18)
#    define KINETIS_FLASH_SIZE      (1024*1024)  /* 1Mb */
#    define KINETIS_FLEXNVM_SIZE    (256*1024)   /* 256Kb  */
#    define KINETIS_FLEXRAM_SIZE    (4*1024)     /* 4Kb */
#    define KINETIS_SRAM_SIZE       (256*1024)   /* 256Kb */
#  endif
#  if defined(CONFIG_ARCH_CHIP_MK66FN2M0VMD18) || \
      defined(CONFIG_ARCH_CHIP_MK66FN2M0VLQ18)
#    define KINETIS_FLASH_SIZE      (2048*1024)  /* 2Mb */
#  undef  KINETIS_FLEXNVM_SIZE                   /* No FlexNVM */
#    define KINETIS_FLEXRAM_SIZE    (4*1024)     /* 4Kb */
#    define KINETIS_SRAM_SIZE       (256*1024)   /* 256Kb */
#  endif
#  define KINETIS_MPU             1            /* Memory protection unit */
#  define KINETIS_MPU_NEGIONS     8            /* 8 MPU descriptors (REVISIT) */
#  define KINETIS_EXTBUS          1            /* External bus interface */
#  define KINETIS_NDMACH          32           /* Up to 32 DMA channels */
#  define KINETIS_NENET           1            /* One IEEE 1588 Ethernet controller */
#  define KINETIS_NUSBOTG         1            /* With USB OTG controller */
#  define KINETIS_NUSBDEV         1            /* One USB device controller */
#  define KINETIS_NSDHC           1            /* SD host controller */
#  define KINETIS_NI2C            4            /* Four I2C modules */
#  define KINETIS_NUART           5            /* Five UART modules */
#  define KINETIS_NLPUART         1            /* One LPUART modules */
#  define KINETIS_NSPI            3            /* Three SPI modules */
#  define KINETIS_NCAN            2            /* Two CAN controllers */
#  define KINETIS_NI2S            1            /* One I2S modules */
#  undef  KINETIS_NSLCD                        /* No segment LCD interface */
#  define KINETIS_NADC16          2            /* Four 16-bit ADC */
#  define KINETIS_NCMP            4            /* Four analog comparators */
#  define KINETIS_NDAC6           4            /* Four 6-bit DAC */
#  define KINETIS_NDAC12          2            /* Two 12-bit DAC */
#  define KINETIS_NVREF           1            /* Voltage reference */
#  define KINETIS_NTIMERS8        2            /* Two 8 channel FTM timers */
#  define KINETIS_NTIMERS2        2            /* Two 2 channel FTM timers */
#  define KINETIS_NTPMTIMERS2     2            /* Two 2 channel TPM timers */
#  define KINETIS_NRTC            1            /* Real time clock */
#  define KINETIS_NRNG            1            /* Random number generator */
#  define KINETIS_NMMCAU          1            /* Hardware encryption */
#  define KINETIS_NCRC            1            /* CRC */
#else
#  error "Unsupported Kinetis chip"
#endif

/* NVIC priority levels *****************************************************/

/* Each priority field holds a priority value, 0-15. The lower the value,
 * the greater the priority of the corresponding interrupt. The processor
 * implements only bits[7:4] of each field, bits[3:0] read as zero and ignore
 * writes.
 */

#define NVIC_SYSH_PRIORITY_MIN     0xf0 /* All bits[7:4] set is minimum priority */
#define NVIC_SYSH_PRIORITY_DEFAULT 0x80 /* Midpoint is the default */
#define NVIC_SYSH_PRIORITY_MAX     0x00 /* Zero is maximum priority */
#define NVIC_SYSH_PRIORITY_STEP    0x10 /* Steps between supported priority values */

/****************************************************************************
 * Public Types
 ****************************************************************************/

/****************************************************************************
 * Public Data
 ****************************************************************************/

/****************************************************************************
 * Public Functions Prototypes
 ****************************************************************************/

#endif /* __ARCH_ARM_INCLUDE_KINETIS_CHIP_H */
